framework/storage/xml/pedimento/Inmetmatic/listarpedimentos_240_2017-08-29.xml

<?xml version="1.0"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:lis="http://www.ventanillaunica.gob.mx/pedimentos/ws/oxml/listarpedimentos">
 	<soapenv:Header>
		<wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" soapenv:mustUnderstand="1">
		 	<wsse:UsernameToken>
		 		<wsse:Username>INM060424AP3</wsse:Username>
		 		<wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">Uz+p+vcet8WshoVjhNNPpEYfmWM6NHkI/YDKI0hQ88032spLmvCSfAcNu1RLGcfE</wsse:Password>
		 	</wsse:UsernameToken>
	 	</wsse:Security>
	</soapenv:Header>
	<soapenv:Body>
		<lis:consultarPedimentosPeticion>
			<lis:peticion>
				<lis:aduana>240</lis:aduana>
			 	<lis:patente/>
			 	<lis:pedimento/>
			 	<lis:eDocumentCove/>
			 	<lis:rfc>INM060424AP3</lis:rfc>
			 	<lis:contenedor/>
			 	<lis:guia/>
			 	<lis:fechaInicio>2017-08-29</lis:fechaInicio>
			 	<lis:fechaFin>2017-08-29</lis:fechaFin>
		 	</lis:peticion>
		</lis:consultarPedimentosPeticion>
	</soapenv:Body>
</soapenv:Envelope>
