framework/storage/xml/pedimento/FICR/listarpedimentos_640_2017-09-19.xml

<?xml version="1.0"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:lis="http://www.ventanillaunica.gob.mx/pedimentos/ws/oxml/listarpedimentos">
 	<soapenv:Header>
		<wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" soapenv:mustUnderstand="1">
		 	<wsse:UsernameToken>
		 		<wsse:Username>FMA140328MK0</wsse:Username>
		 		<wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">kXTZ8hcg6/hChAAtxvNnhZ2MD5EaimvbedQA5aAzx7N83bRcBINdwBG6LdB2rN9w</wsse:Password>
		 	</wsse:UsernameToken>
	 	</wsse:Security>
	</soapenv:Header>
	<soapenv:Body>
		<lis:consultarPedimentosPeticion>
			<lis:peticion>
				<lis:aduana>640</lis:aduana>
			 	<lis:patente/>
			 	<lis:pedimento/>
			 	<lis:eDocumentCove/>
			 	<lis:rfc>FMA140328MK0</lis:rfc>
			 	<lis:contenedor/>
			 	<lis:guia/>
			 	<lis:fechaInicio>2017-09-19</lis:fechaInicio>
			 	<lis:fechaFin>2017-09-19</lis:fechaFin>
		 	</lis:peticion>
		</lis:consultarPedimentosPeticion>
	</soapenv:Body>
</soapenv:Envelope>
